src/cf/src/InformationRegisters/бф_ЗначенияКонстант/бф_ЗначенияКонстант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бф_ЗначенияКонстант</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/CommonModules/бф_КонстантыПовтИсп/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Значения констант.
// 
// Параметры:
//  Дата - Дата
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//  	* Ключ - см. РегистрСведений.бф_ЗначенияКонстант.Ключ
//  	* Значение - см. РегистрСведений.бф_ЗначенияКонстант.Значение
Функция ЗначенияКонстант(Дата) Экспорт
	
	ВыборкаДетальныеЗаписи = ВыборкаЗначенияКонстант(Дата);
	
	Результат = Новый Соответствие();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.Ключ, ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла;                                                                          
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выборка значения констант.
// 
// Параметры:
//  Дата - Дата
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка значения констант:
//  	* Ключ - см. РегистрСведений.бф_ЗначенияКонстант.Ключ
//  	* Значение - см. РегистрСведений.бф_ЗначенияКонстант.Значение
Функция ВыборкаЗначенияКонстант(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бф_ЗначенияКонстантСрезПоследних.Ключ КАК Ключ,
	|	бф_ЗначенияКонстантСрезПоследних.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.бф_ЗначенияКонстант.СрезПоследних(&Период, ) КАК бф_ЗначенияКонстантСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

#КонецОбласти
